LiggghtsCodesAndCase-master/LiggghtsCodesAndCase-master/capiTemp/CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Laminar viscosity
nu              nu [ 0 2 -1 0 0 0 0 ] 1.5e-05;

// Laminar Prandtl number
Pr              [0 0 0 0 0 0 0] 0.71; // alpha=nu/Pr=2.1399e-5

// Turbulent Prandtl number
Prt             [0 0 0 0 0 0 0] 1e15;


// ************************************************************************* //
